app/controllers/cadernos_controller.rb

SELECT "cadernos".* FROM "cadernos"
---
  def index
    @cadernos = Caderno.all

INSERT INTO "cadernos" ("titulo", "conteudo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["titulo", ""], ["conteudo", "<p><strong>t5rfvthcr5</strong></p>\r\n"], ["created_at", "2017-12-05 19:32:51.723858"], ["updated_at", "2017-12-05 19:32:51.723858"]]
---
  def create
    @disciplinas = Disciplina.all
    @caderno = Caderno.new(caderno_params)

    respond_to do |format|

      if @caderno.save

UPDATE "cadernos" SET "titulo" = ?, "conteudo" = ?, "updated_at" = ? WHERE "cadernos"."id" = ?
---
  def update
    @disciplinas = Disciplina.all
    respond_to do |format|
      if @caderno.update(caderno_params)

SELECT  "cadernos".* FROM "cadernos" WHERE "cadernos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_caderno
      @caderno = Caderno.find(params[:id])