app/controllers/disciplinas_controller.rb

SELECT "disciplinas".* FROM "disciplinas"
---
  def index
    @disciplinas = Disciplina.all

INSERT INTO "disciplinas" ("nome", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["nome", "tese"], ["created_at", "2017-12-05 23:34:42.692449"], ["updated_at", "2017-12-05 23:34:42.692449"], ["user_id", 1]]
---
  def create
    @disciplinas = Disciplina.all
    @disciplina = current_user.disciplinas.build(disciplina_params)

    respond_to do |format|
      if @disciplina.save

SELECT  "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_disciplina
      @disciplina = Disciplina.find(params[:id])